# -*- coding: cp936 -*-

# 输入一个四位整数,对其加密后输出
# 加密方法:每位数字分别加9后除以10取余数,从而得到四位新数字
# 然后将千位和十位数字互换,百位和个位数字互换.
# 例如:2017经加密变成0619.
# 注意:若加密后整数的最高位为0,也要求输出.

# 以数值形式输入四位数，取各位数字较麻烦
a = input("请输入一个四位数：")

a3 = a%10                            # 个位
a3 = (a3+9)%10
a = a/10                             # 去掉个位数字
a2 = a%10                            # 十位
a2 = (a2+9)%10
a = a/10                             # 去掉十位数字
a1 = a%10                            # 百位
a1 = (a1+9)%10
a = a/10                             # 去掉百位数字，即得千位数字
a0 = (a+9)%10

# 字符串拼接,避免各位数字间有空格,首位为0也不会丢弃
s = str(a2)+str(a3)+str(a0)+str(a1)

print "加密结果是：",s
